Uni-Hub/app/controllers/api/v1/authentication_controller.rb

      def login
        user = User.find_for_authentication(email: params[:email].to_s.downcase.strip)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]

      def register
        user = User.new(registration_params)

        if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "role", "first_name", "last_name", "department_id", "push_subscription", "notification_preferences", "max_courses", "assigned_courses", "blacklisted", "blacklisted_at", "blacklisted_by_id", "unblacklisted_at", "unblacklisted_by_id", "blacklist_reason", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"