Uni-Hub/app/controllers/api/v1/notes_controller.rb

      def index
        notes = policy_scope(Note).includes(:folder, :tags)
---
SELECT "note_tags".* FROM "note_tags" WHERE "note_tags"."note_id" IN ($1, $2)  [["note_id", 2], ["note_id", 1]]

      def create
        note = current_user.notes.new(note_attributes)
        authorize note

        if note.save
---
INSERT INTO "notes" ("title", "content", "user_id", "created_at", "updated_at", "folder_id", "department_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "New Note"], ["content", "body"], ["user_id", 119], ["created_at", "2026-05-20 01:05:27.772147"], ["updated_at", "2026-05-20 01:05:27.772147"], ["folder_id", nil], ["department_id", nil]]

      def update
        authorize @note

        if @note.update(note_attributes)
---
UPDATE "notes" SET "title" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["title", "New"], ["updated_at", "2026-05-20 01:05:29.730181"], ["id", 18]]

      def destroy
        authorize @note
        @note.destroy!
---
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 21]]